import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

# 連接到 SQLite 資料庫
conn = sqlite3.connect('codinghere-20240208.db')

# 建立一個游標物件
cursor = conn.cursor()

#查詢數據
cursor.execute('''

                ''')


rows = cursor.fetchall()

# 輸出查詢結果
for row in rows:
    print(row)

# 關閉連接
conn.close()

# 設置中文字體
plt.rcParams['font.sans-serif'] = ['Microsoft JhengHei']  # 替換成你的中文字體，如微軟正黑體
plt.rcParams['axes.unicode_minus'] = False  # 解決負號顯示問題

# SQL 查詢结果
data = [
    ('112-王老師運算思維與程式設計', '何沁恩', 364.46683673469386, 60),
    ('112-王老師運算思維與程式設計', '古定加', 599.7830687830688, 60),
    ('112-王老師運算思維與程式設計', '吳晏甄', 157.02702702702703, 60),
    ('112-王老師運算思維與程式設計', '呂宗凱', 416.5483870967742, 60),
    ('112-王老師運算思維與程式設計', '周晉淵', 303.2238805970149, 60),
    ('112-王老師運算思維與程式設計', '周煜恆', 468.42045454545456, 60),
    ('112-王老師運算思維與程式設計', '姚雲捷', 233.69162995594715, 60),
    ('112-王老師運算思維與程式設計', '孫詠鈞', 330.64606741573033, 60),
    ('112-王老師運算思維與程式設計', '官晸曄', 82.87012987012987, 60),
    ('112-王老師運算思維與程式設計', '張仲廷', 151.24683544303798, 60),
    ('112-王老師運算思維與程式設計', '張佑成', 418.24897959183676, 60),
    ('112-王老師運算思維與程式設計', '張庭瑋', 246.57671957671957, 50),
    ('112-王老師運算思維與程式設計', '張愷臻', 165.46226415094338, 60),
    ('112-王老師運算思維與程式設計', '張睿庭', 278.875, 60),
    ('112-王老師運算思維與程式設計', '張維珍', 394.85333333333335, 60),
    ('112-王老師運算思維與程式設計', '徐凱榆', 351.82474226804123, 30),
    ('112-王老師運算思維與程式設計', '曾弘毅', 704.3225806451613, 60),
    ('112-王老師運算思維與程式設計', '朱英齊', 151.1764705882353, 60),
    ('112-王老師運算思維與程式設計', '林依辰', 182.4313725490196, 60),
    ('112-王老師運算思維與程式設計', '林信豪', 333.96774193548384, 60),
    ('112-王老師運算思維與程式設計', '林劭恩', 209.82971014492753, 60),
    ('112-王老師運算思維與程式設計', '林子竣', 164.6044776119403, 60),
    ('112-王老師運算思維與程式設計', '林尚亭', 496.0635838150289, 60),
    ('112-王老師運算思維與程式設計', '林庭毅', 202.66336633663366, 60),
    ('112-王老師運算思維與程式設計', '林美伶', 182.92, 60),
    ('112-王老師運算思維與程式設計', '梁耕綸', 385.7286432160804, 50),
    ('112-王老師運算思維與程式設計', '楊薏主', 234.4102564102564, 60),
    ('112-王老師運算思維與程式設計', '楊閔翔', 591.2207792207793, 60),
    ('112-王老師運算思維與程式設計', '洪佑瑋', 151.05479452054794, 40),
    ('112-王老師運算思維與程式設計', '洪平', 120.38152610441767, 60),
    ('112-王老師運算思維與程式設計', '洪承浩', 229.21857923497268, 60),
    ('112-王老師運算思維與程式設計', '王筠凱', 336.9503546099291, 50),
    ('112-王老師運算思維與程式設計', '翁博軒', 161.1578947368421, 60),
    ('112-王老師運算思維與程式設計', '莊崴棋', 556.358904109589, 60),
    ('112-王老師運算思維與程式設計', '葉威廷', 603.10625, 60),
    ('112-王老師運算思維與程式設計', '蔡中勝', 320.04761904761904, 60),
    ('112-王老師運算思維與程式設計', '蔡乙慈', 271.49006622516555, 30),
    ('112-王老師運算思維與程式設計', '蔡宗晏', 420.4761904761905, 60),
    ('112-王老師運算思維與程式設計', '蔡政洋', 180.22222222222223, 0),
    ('112-王老師運算思維與程式設計', '蕭隆曄', 425.728813559322, 60),
    ('112-王老師運算思維與程式設計', '藍智瀚', 295.5483870967742, 60),
    ('112-王老師運算思維與程式設計', '蘇子杰', 279.7848605577689, 50),
    ('112-王老師運算思維與程式設計', '詹立祺', 318.26666666666665, 50),
    ('112-王老師運算思維與程式設計', '趙彥鈞', 145.2, 60),
    ('112-王老師運算思維與程式設計', '邱柏維', 116.71428571428571, 50),
    ('112-王老師運算思維與程式設計', '陳喆', 346.2520325203252, 60),
    ('112-王老師運算思維與程式設計', '陳懌鴻', 89.58510638297872, 60),
    ('112-王老師運算思維與程式設計', '陳昀陞', 257.41843971631204, 60),
    ('112-王老師運算思維與程式設計', '陳昱維', 391.8271186440678, 60),
    ('112-王老師運算思維與程式設計', '陳漢邦', 266.2041884816754, 60),
    ('112-王老師運算思維與程式設計', '陳靖淵', 197.58, 50),
    ('112-王老師運算思維與程式設計', '馮柏諺', 406.21238938053096, 60),
    ('112-王老師運算思維與程式設計', '黃品嘉', 435.45454545454544, 50),
    ('112-王老師運算思維與程式設計', '黃科傑', 415.49367088607596, 30),
    ('112-王老師運算思維與程式設計', '黃筠筑', 628.7421602787457, 60)
]

# 分組資料
class_a_midterm = [(d[2], d[3]) for d in data if d[0] == '112-王老師運算思維與程式設計']


# 繪製散點圖
plt.figure(figsize=(10, 6))  # 設定圖表大小

plt.scatter(*zip(*class_a_midterm), color='gold', marker='o')


plt.xlabel('每週作答時間 (秒)')
plt.ylabel('期中考分數')
plt.title('112-王老師運算思維與程式設計')
plt.grid(True)  # 添加網格線
plt.show()
